#დღევანდელი თემა შეეხება LISTS
#თეორიული მასალა მოცემულიუ იქნება კომენტარების სახით და მასალა იქნება ატვირთული გითჰაბზე

myList = ['Banana', "chery", "apple"]
print(myList)

mylist2 = list()
print(mylist2)
# ლისტში შესაძლებელია სხვადასხვა დატათეიფის განთავსება (1, 2, True, False, "string", 2.50, "string") ლისტში დასაშვებია დუბლიკატების არსებობა
# ლისტიდან შეიძლება დაინდექსებით შესაძლოა ელემენტების ამოღება და ლისტი არის იტერირებადი. 
# ლისტზე მუშაოპობს append() მეთოდი და ის ბოლოში ამატებს სასურველ ელემენტს ხოლო insert() მეთოდში ვუთითებთ ორ კომპონენეტს ინდექსს სადაც გვინდა რომ ელემენტი განთავსდეს ლისტში
# და თვითონ განსათავსებელ ელემენტს mylist.insert(2, "string") აქ ლისტში მეორე პოზიციაზე ხდება ელემენტის დამატება.
# წაშლა შესაძლებელია  pop() მეთოდით და ის ბოლო ელემენტს ამოაგდებს და მოგვცემს ლოსტიდან
# ხოლო სპეციპიკური ელემენტის წაშლა თუ გვინდა მაშინ უნდა გამოვიყენოთ .reomove() მეთოდი სადაც უნდა მოხდეს წასაშლელი ელემენტის მითითება .remove("apple") ორივე შემთხვევაში 
# შეგვიძლია წაშლილი და ამოვარდნილი ელემენტების გამოძახება მაგალითად item = mylist.remove("apple") print(item) ....... "apple" იგივენაირად ხდება pop მეთოდზე